class_name: Model
config:
  input_layers:
  - [left_features, 0, 0]
  - [central_features, 0, 0]
  - [right_features, 0, 0]
  - [beat, 0, 0]
  - [beats_left, 0, 0]
  - [beats_right, 0, 0]
  - [fermatas_left, 0, 0]
  - [fermatas_right, 0, 0]
  - [central_fermata, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 99]
      input_dtype: float32
      name: left_features
    inbound_nodes: []
    name: left_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 4]
      input_dtype: float32
      name: beats_left
    inbound_nodes: []
    name: beats_left
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 2]
      input_dtype: float32
      name: fermatas_left
    inbound_nodes: []
    name: fermatas_left
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 99]
      input_dtype: float32
      name: right_features
    inbound_nodes: []
    name: right_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 4]
      input_dtype: float32
      name: beats_right
    inbound_nodes: []
    name: beats_right
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 2]
      input_dtype: float32
      name: fermatas_right
    inbound_nodes: []
    name: fermatas_right
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_9,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [left_features, 0, 0]
      - [beats_left, 0, 0]
      - [fermatas_left, 0, 0]
    name: merge_9
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 76]
      input_dtype: float32
      name: central_features
    inbound_nodes: []
    name: central_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 4]
      input_dtype: float32
      name: beat
    inbound_nodes: []
    name: beat
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 2]
      input_dtype: float32
      name: central_fermata
    inbound_nodes: []
    name: central_fermata
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_10,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [right_features, 0, 0]
      - [beats_right, 0, 0]
      - [fermatas_right, 0, 0]
    name: merge_10
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          W_constraint: null
          W_regularizer: null
          activation: linear
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          batch_input_shape: !!python/tuple [null, 105]
          bias: true
          init: glorot_uniform
          input_dim: 105
          input_dtype: float32
          name: embedding_left
          output_dim: 200
          trainable: true
      name: timedistributed_5
      trainable: true
    inbound_nodes:
    - - [merge_9, 0, 0]
    name: timedistributed_5
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_11,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [central_features, 0, 0]
      - [beat, 0, 0]
      - [central_fermata, 0, 0]
    name: merge_11
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          W_constraint: null
          W_regularizer: null
          activation: linear
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          batch_input_shape: !!python/tuple [null, 105]
          bias: true
          init: glorot_uniform
          input_dim: 105
          input_dtype: float32
          name: embedding_right
          output_dim: 200
          trainable: true
      name: timedistributed_6
      trainable: true
    inbound_nodes:
    - - [merge_10, 0, 0]
    name: timedistributed_6
  - class_name: LSTM
    config:
      U_regularizer: null
      W_regularizer: null
      activation: tanh
      b_regularizer: null
      batch_input_shape: !!python/tuple [null, null, 200]
      consume_less: cpu
      dropout_U: 0.0
      dropout_W: 0.0
      forget_bias_init: one
      go_backwards: false
      init: glorot_uniform
      inner_activation: hard_sigmoid
      inner_init: orthogonal
      input_dim: 200
      input_dtype: float32
      input_length: null
      name: lstm_left_0
      output_dim: 200
      return_sequences: true
      stateful: false
      trainable: true
      unroll: false
    inbound_nodes:
    - - [timedistributed_5, 0, 0]
    name: lstm_left_0
  - class_name: Dense
    config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
      name: dense_7, output_dim: 200, trainable: true}
    inbound_nodes:
    - - [merge_11, 0, 0]
    name: dense_7
  - class_name: LSTM
    config:
      U_regularizer: null
      W_regularizer: null
      activation: tanh
      b_regularizer: null
      batch_input_shape: !!python/tuple [null, null, 200]
      consume_less: cpu
      dropout_U: 0.0
      dropout_W: 0.0
      forget_bias_init: one
      go_backwards: false
      init: glorot_uniform
      inner_activation: hard_sigmoid
      inner_init: orthogonal
      input_dim: 200
      input_dtype: float32
      input_length: null
      name: lstm_right_0
      output_dim: 200
      return_sequences: true
      stateful: false
      trainable: true
      unroll: false
    inbound_nodes:
    - - [timedistributed_6, 0, 0]
    name: lstm_right_0
  - class_name: LSTM
    config:
      U_regularizer: null
      W_regularizer: null
      activation: tanh
      b_regularizer: null
      batch_input_shape: !!python/tuple [null, null, 200]
      consume_less: cpu
      dropout_U: 0.0
      dropout_W: 0.0
      forget_bias_init: one
      go_backwards: false
      init: glorot_uniform
      inner_activation: hard_sigmoid
      inner_init: orthogonal
      input_dim: 200
      input_dtype: float32
      input_length: null
      name: lstm_left_1
      output_dim: 200
      return_sequences: false
      stateful: false
      trainable: true
      unroll: false
    inbound_nodes:
    - - [lstm_left_0, 0, 0]
    name: lstm_left_1
  - class_name: Dense
    config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
      name: dense_8, output_dim: 200, trainable: true}
    inbound_nodes:
    - - [dense_7, 0, 0]
    name: dense_8
  - class_name: LSTM
    config:
      U_regularizer: null
      W_regularizer: null
      activation: tanh
      b_regularizer: null
      batch_input_shape: !!python/tuple [null, null, 200]
      consume_less: cpu
      dropout_U: 0.0
      dropout_W: 0.0
      forget_bias_init: one
      go_backwards: false
      init: glorot_uniform
      inner_activation: hard_sigmoid
      inner_init: orthogonal
      input_dim: 200
      input_dtype: float32
      input_length: null
      name: lstm_right_1
      output_dim: 200
      return_sequences: false
      stateful: false
      trainable: true
      unroll: false
    inbound_nodes:
    - - [lstm_right_0, 0, 0]
    name: lstm_right_1
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_12,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [lstm_left_1, 0, 0]
      - [dense_8, 0, 0]
      - [lstm_right_1, 0, 0]
    name: merge_12
  - class_name: Dense
    config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
      name: dense_9, output_dim: 200, trainable: true}
    inbound_nodes:
    - - [merge_12, 0, 0]
    name: dense_9
  - class_name: Dense
    config:
      W_constraint: null
      W_regularizer: null
      activation: softmax
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      bias: true
      init: glorot_uniform
      input_dim: null
      name: pitch_prediction
      output_dim: !!python/object/apply:numpy.core.multiarray.scalar
      - !!python/object/apply:numpy.dtype
        args: [i8, 0, 1]
        state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
      - !!binary |
        FwAAAAAAAAA=
      trainable: true
    inbound_nodes:
    - - [dense_9, 0, 0]
    name: pitch_prediction
  name: model_3
  output_layers:
  - [pitch_prediction, 0, 0]
keras_version: 1.0.8
